---
kind: property
id: P:Autodesk.Revit.DB.UpdaterInfo.ApplicationName
source: html/c3ba3711-3f49-5069-a944-61601e550550.htm
---
# Autodesk.Revit.DB.UpdaterInfo.ApplicationName Property

Name of the application that owns the updater.

## Syntax (C#)
```csharp
public string ApplicationName { get; }
```